tutorials/case329-flibe-channel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case329-flibe-channel
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// FLiBe vertical channel with distributed H2 source → SS316 permeation.
//
// Two-region case:
//   fluid  — FLiBe molten salt (speciesFluid: PIMPLE U/p + T + C_H2)
//   solid  — SS316 stainless steel (speciesSolid: diffusion only)
//
// Hydrogen produced uniformly in FLiBe at rate S = 1e-5 mol/(m³·s).
// Advected upward by flow (U_in = 0.01 m/s) and diffused toward the wall.
// Permeates through SS316 via Sieverts-law interface; exits at outer surface
// (C = 0, vacuum BC).

application     foamMultiRun;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;

deltaT          1;

writeControl    runTime;
writeInterval   200;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;

runTimeModifiable yes;

regionSolvers
{
    fluid   speciesFluid;
    solid   speciesSolid;
}

libs
(
    "libspeciesTransport.so"
    "libspeciesSolid.so"
    "libspeciesFluid.so"
    "libspeciesCoupling.so"
);

// ************************************************************************* //
